fix: 다이어그램 수정 및 MySQL 버전 문제 수정
